Revit 2026 API

# FamilyParameterGetUnitTypeId Method

---

Gets the identifier of the unit quantifying the parameter value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ForgeTypeId GetUnitTypeId()
```
```vb
Public Function GetUnitTypeId As ForgeTypeId
```
```cpp
public:
ForgeTypeId^ GetUnitTypeId()
```
```fsharp
member GetUnitTypeId : unit -> ForgeTypeId
```

#### Return Value

ForgeTypeId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if this parameter is not of value type. |

#### Reference

FamilyParameter Class

Autodesk.Revit.DB Namespace